Revit 2027 API
TessellatedShapeBuilder.IsFaceSetOpen Property
 Flag whether the current set of connected faces is open and additional tessellation faces can be added to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFaceSetOpen { get; }
Public ReadOnly Property IsFaceSetOpen As Boolean
	Get
public:
property bool IsFaceSetOpen {
	bool get ();
}
member IsFaceSetOpen : bool with get
Property Value
Boolean
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace